function tao=Angular_offset_NSNP(afai,a,n,r,f)
%==========================================================================
%本程序是用来计算既不射向光心，又不平行于主光轴的光线传播方式的函数
%输入的是入射点a,a可以通过x(a)反函数计算得到,射线与主光轴夹角afai，折射率n
%输出的是该点经凸透镜折射后的与主光轴的夹角ra
%创建人：毛家发
%创建时间：2021-09-06
%完成时间：2021-09-06
%==========================================================================
%afai1=Mapping_r2d(x,r);
sat=Normal_vector(a,f,r,n);
if(a<=sat)
    y1=asin(sin(sat-afai)/n);
    tao=sat-y1;
else
    y1=abs(asin(sin(afai-sat)/n));
    tao=sat+y1;
end
